/* c2pad h8sampleGAIYOU                        */
/* pad2pdf h8sampleGAIYOU.c h8sampleGAIYOU.pdf */

void タイマー0のハンドラー(void)
{
  カウンター値++;
  タイマーハンドラー呼び出し;
  など;
}

void タイマー0の初期化(コンペアマッチ, ハンドラーが実行する関数)
{
  コンペアマッチを設定;
  タイマーハンドラーを設定;
}

void タイマー0の開始(void)
{
  タイマー0の開始;
}

void タイマー0の停止(void)
{
  タイマー0の停止;
}

/* pad2ps: newpage */

void 正転する(void)
{
  モーター正転;
}

void 逆転する(void)
{
  モーター逆転;
}

void 停止する(void)
{
  モーターストップ;
}

エンコーダー値 エンコーダー値を取得する(void)
{
  モーターのエンコーダー値の取得;
}

/* pad2ps: newpage */

void 数値LEDを表示する(表示する数値)
{
  数値LEDへの数値表示（ダイナミック点灯）;
}

void 数値LEDを消灯する(void)
{
  数値LEDの消灯;
}

void LEDを点灯する(パターン)
{ // bit4は消灯(使用できない)、bit4以外は1で点灯
  LEDのbit4以外を2進数で点灯;
}

void 初期化(void)
{
  変数の宣言と初期化;
  実行時オプション「- B」の読み取り;
  実行時オプション「- B」の表示;
  H8ポートの初期化;
  タイマー0の初期化(「0.1秒相当のコンペアマッチ」, null);
}

/* pad2ps: newpage */

void 終了処理(void)
{
  タイマー0の停止;
  停止する();
  LEDを点灯する（消灯パターン);
  数値LEDを消灯する();
}

int main(int argc, char **argv)
{
  初期化();
  while (1)
  {
    プッシュスイッチP50およびP51の両方が押されていたらbreakする;
    プッシュスイッチP51が押されていたらモードを「回転」に設定;
    プッシュスイッチP50が押されていたらモードを「停止」に設定;
    モードとスイッチP53の値によってモーターの正転・逆転・停止を制御;
    エンコーダー値 = エンコーダー値を取得する();
    回転数 = エンコーダー値をもとにモーターの回転方向を検出し、回転数を算出する;
    数値LEDを表示する(回転数);
    カウンター値 = タイマー0のカウンター値を取得する();
    カウンター値をもとに0 .5秒ごとにLEDの点灯 / 消灯を切り替える;
  }
  終了処理();
  使い方を表示する;
  return 0;
}
