/* c2pad h8sampleledDETAIL */

Ver(1.20)
{
	"2025/4/23";
}

LEDパラメータ *LEDパラメータを取得する(void)
{
	LEDパラメータ（点灯パターン、点滅周期、点滅モード）へのポインタを返却;
}

void 点灯する(点灯パターン)
{ // bit4は消灯(使用できない)、bit4以外は1で点灯
	LEDのbit4以外を2進数で点灯;
}

void 点灯パターンを設定する(点灯パターン)
{
	点灯パターンをLEDパラメータに記録する;
}

void 点滅モードを設定する(点滅モード)
{
	点滅モードをLEDパラメータに記録する;
}


/* pad2ps: newpage */

void 点滅周期を設定する(点滅周期)
{
	点滅周期をLEDパラメータに記録する;
}

void led_handler(void)
{
	タイマーのカウント値 = タイマー0から取得する();
	点滅周期 = パラメータから取得;
	点滅モード = パラメータから取得;
	点灯状態 = false;

	switch (点滅モード)
	{
	case 0:
		常時点灯:
		点灯状態 = true;
		break;

	case 1:
		方法1「点滅周期を200で割り切れる最小単位に切り捨て」:
		if ((カウント値 / (点滅周期 / 200)) % 2 == 0)
			点灯状態 = true;
		break;

	case 2:
		方法2「点滅周期を200に四捨五入して近似」:
		if ((カウント値 / ((点滅周期 + 100) / 200)) % 2 == 0)
			点灯状態 = true;
		break;

	case 3:
		方法3「カウント値と点滅周期に応じて、長期的に正確な周期になるように点滅を判断」:
		if (((カウント値 * 200) / 点滅周期) % 2 == 0)
			点灯状態 = true;
		break;
	}

	if (点灯状態)
	{
		LEDを点灯する(点灯パターン);
	}
	else
	{
		LEDを点灯する(0); // 消灯
	}
}


/* pad2ps: newpage */

void 初期化(void)
{
	変数の宣言と初期化;
	実行時オプション「点灯パターン」「点滅モード」「点滅周期」（「- N」「- F」「- B」「- DEBUG」）の読み取り;
	実行時オプション「- N」「- F」「- B」「- DEBUG」の表示;
	H8ポートの初期化;
	inti_timer(COUNT_100MESC, led_handler);
	点灯パターンを設定する(点灯パターン);
	点滅モードを設定する(点滅モード);
	点滅周期を設定する(点滅周期);
	start_timer0();
}

void 終了処理(void)
{
	タイマー0の停止;
	停止する();
  LEDを点灯する（消灯パターン);
  数値LEDを消灯する();
}

/* pad2ps: newpage */

int main(int argc, char **argv)
{
	初期化();
	while (1)
	{
		プッシュスイッチP50およびP51の両方が押されていたらbreakする;
		プッシュスイッチP51が押されていたらモードを「回転」に設定;
		プッシュスイッチP50が押されていたらモードを「停止」に設定;
		モードとスイッチP53の値によってモーターの正転・逆転・停止を制御;
		エンコーダー値 = エンコーダー値を取得する();
		回転数 = エンコーダー値をもとにモーターの回転方向を検出し、回転数を算出する;
		数値LEDを表示する(回転数);
		点灯パターンを設定する(点灯パターン);
		if (デバッグモード) {
			mcountの値を表示する();
		}
	}
	終了処理();
	使い方を表示する;
	return 0;
}
